# Loading CSV file into a SQLite database

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/students.csv")

In [3]:
# Preview the first few rows of the DataFrame
df.head()

,Student ID,Name,Age,Subject,Year of Study,Country of Origin
0,2703f3f0,Mr Clifford Watson,25.0,English Literature,1.0,Saint Barthelemy
1,a8040287,Elliott Ward,25.0,Computer Science,4.0,Guinea
2,d8da5486,Miss Pauline Dunn,22.0,Engineering,4.0,Afghanistan
3,3ac1b74d,Mr Dominic Mason,22.0,Physics,1.0,Palau
4,67850858,Mrs Melanie Brown,18.0,English Literature,3.0,Algeria

In [4]:
import sqlite3

## Create (or update) the database

In [5]:
# Connect to SQLite database (or create it)
conn = sqlite3.connect("./data/students.db")

# Load the data into the SQLite database
df.to_sql("students", conn, if_exists="replace", index=False)

# Close the database connection
conn.close()

## Load the first record from the db and display

In [6]:
# Connect to the SQLite database
conn = sqlite3.connect("./data/students.db")

# Query the first record from the table
query = "SELECT * FROM students LIMIT 1"
first_record = conn.execute(query).fetchone()

# Close the database connection
conn.close()

In [7]:
# Display the first record
print("First record:", first_record)

First record: ('2703f3f0', 'Mr Clifford Watson', 25.0, 'English Literature', 1.0, 'Saint Barthelemy')

## Loading an Excel file to a DataFrame

In [8]:
# For this to work you need to have installed openpyxl, e.g. with pip or conda
df = pd.read_excel('./data/Students.xlsx', sheet_name='students')
df.head()

,Student ID,Name,Age,Subject,Year of Study,Country of Origin
0,2703f3f0,Mr Clifford Watson,25.0,English Literature,1.0,Saint Barthelemy
1,a8040287,Elliott Ward,25.0,Computer Science,4.0,Guinea
2,d8da5486,Miss Pauline Dunn,22.0,Engineering,4.0,Afghanistan
3,3ac1b74d,Mr Dominic Mason,22.0,Physics,1.0,Palau
4,67850858,Mrs Melanie Brown,18.0,English Literature,3.0,Algeria